<template>
  <dv-border-box-12 class="box-bg-blue">
    <div class=""
         style="height:100%;overflow: hidden;display: flex;flex-direction: column;align-items: stretch;position: relative;gap: 10px;padding: 0 8px;">

      <div class="module-title-sm">车辆到场、发货信息</div>
      <dv-scroll-board :config="config" style="height:calc(100% - 60px)"/>
    </div>
  </dv-border-box-12>

</template>

<script>
export default {
  name: 'A4',
  data() {
    return {
      config: {
        header: ['项目名称', '叶片型号', '叶片组号', '到厂时间', '装车时间', '放行时间'],
        data: [
          ['风力发电项目A', 'LM40.0', '123456', '2023-08-01', '2023-08-02', '2023-08-03'],
          ['风力发电项目B', 'LM50.0', '789012', '2023-08-04', '2023-08-05', '2023-08-06'],
          ['风力发电项目C', 'LM60.0', '345678', '2023-08-07', '2023-08-08', '2023-08-09'],
          ['风力发电项目D', 'LM70.0', '901234', '2023-08-10', '2023-08-11', '2023-08-12'],
          ['风力发电项目E', 'LM80.0', '567890', '2023-08-13', '2023-08-14', '2023-08-15'],
          ['风力发电项目F', 'LM90.0', '234567', '2023-08-16', '2023-08-17', '2023-08-18'],
          ['风力发电项目G', 'LM100.0', '456789', '2023-08-19', '2023-08-20', '2023-08-21'],
          ['风力发电项目H', 'LM110.0', '678901', '2023-08-22', '2023-08-23', '2023-08-24'],
          ['风力发电项目I', 'LM120.0', '890123', '2023-08-25', '2023-08-26', '2023-08-27'],
          ['风力发电项目J', 'LM130.0', '012345', '2023-08-28', '2023-08-29', '2023-08-30'],
          ['风力发电项目K', 'LM140.0', '123456', '2023-08-31', '2023-09-01', '2023-09-02'],
          ['风力发电项目L', 'LM150.0', '234567', '2023-09-03', '2023-09-04', '2023-09-05'],
          ['风力发电项目M', 'LM160.0', '345678', '2023-09-06', '2023-09-07', '2023-09-08'],
          ['风力发电项目N', 'LM170.0', '456789', '2023-09-09', '2023-09-10', '2023-09-11'],
          ['风力发电项目O', 'LM180.0', '567890', '2023-09-12', '2023-09-13', '2023-09-14']
        ],
        index: true,
        align: ['center', 'left', 'center', 'center', 'center'],
        rowNum: 4,
        columnWidth: [40, 160, 100, 100, 110, 110, 110]
      }
    }
  },
  created() {

  }
}
</script>

<style lang="less" scoped>

</style>
